# configs/yolo11-mobilenetv3-slimneck-p2.yaml
nc: 2 # 你的类别数

scales:
  n: [0.33, 0.25, 1024]

backbone:
  # 输出一个 list: [P2, P3, P4, P5]
  - [-1, 1, MobileNetV3_Backbone, []]

head:
  # 接收 backbone 的 list，经过 Slim-Neck，输出融合后的 [P2_f, P3_out, P4_out, P5_out]
  - [-1, 1, YOLOv11_MobileNetV3_SlimNeck_Head, []]

  # 【终极奥义】：不要 Select，直接把上一层输出的 list 喂给 DetectWrapper
  # 强制硬编码告诉它通道数是 [nc, 64, 128, 256, 256]
  - [-1, 1, DetectWrapper, [nc, 64, 128, 256, 256]]